let data = ['사자','다람쥐','원숭이','다람쥐','악어','사슴','강아지','강아지','고양이','고양이','고양이','고양이','다람쥐','악어','사자','악어','사자','사슴','원숭이','원숭이','설표','설표','다람쥐','사자','사자','악어','원숭이','원숭이','사슴','강아지','사자','강아지','강아지','고양이','고양이','고양이','악어','설표','설표','사자','고양이','사슴','다람쥐','강아지','다람쥐','원숭이','원숭이','사자','악어','원숭이','사자','사자','다람쥐','사자','고양이','다람쥐','사자','사슴','설표','설표','설표',]

// '사자', '고양이', '원숭이', '설표', '강아지', '사슴', '악어', '다람쥐',
console.log(data)

let 중복제거데이터 = [...new Set(data)]

function 결과(x,y){
   let 새배열 = y.filter(기준단어 => 기준단어 === x)
   return 새배열
}

let cnt = data.reduce((cnt,ele)=>cnt + ('고양이' === ele),0)
console.log(cnt)

function 결과2(x,y){
    let cnt = y.reduce((cnt,ele) => cnt + (x === ele),0)
    return cnt
}

console.log(결과2('강아지',data))


중복제거데이터.forEach((x)=>{
    console.log(x, ':',결과2(x,data))
})
